In [1]:
import pandas as pd

In [ ]:
# long data 만들기
- 각 변수는 하나의 컬럼에 배치
- 각 관측치는 한행에 1건씩 분리되어 배치
- 각 값은 개별 셀에 배치되어야 한다.

In [5]:
#pew data load
#C:\Users\Admin\hipython\data\pew.csv
#pd.read_csv(r'C:\Users\Admin\hipython\data\pew.csv')
df=pd.read_csv('./data/pew.csv')
type(df)

pandas.core.frame.DataFrame

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   religion            18 non-null     object
 1   <$10k               18 non-null     int64
 2   $10-20k             18 non-null     int64
 3   $20-30k             18 non-null     int64
 4   $30-40k             18 non-null     int64
 5   $40-50k             18 non-null     int64
 6   $50-75k             18 non-null     int64
 7   $75-100k            18 non-null     int64
 8   $100-150k           18 non-null     int64
 9   >150k               18 non-null     int64
 10  Don't know/refused  18 non-null     int64
dtypes: int64(10), object(1)
memory usage: 1.7+ KB

In [8]:
df.columns

Index(['religion', '<$10k', '$10-20k', '$20-30k', '$30-40k', '$40-50k',
       '$50-75k', '$75-100k', '$100-150k', '>150k', 'Don't know/refused'],
      dtype='object')

In [9]:
df.head(3)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54

In [ ]:
df.melt(id_vars='religion').sort_values('religion').head(10) #메소드체인

     religion            variable  value
0    Agnostic               <$10k     27
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96
126  Agnostic           $100-150k    109
36   Agnostic             $20-30k     60
108  Agnostic            $75-100k    122
18   Agnostic             $10-20k     34
90   Agnostic             $50-75k    137
72   Agnostic             $40-50k     76
54   Agnostic             $30-40k     81

In [14]:
df_melt=df.melt(id_vars='religion')
df_melt

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [16]:
cond=df_melt['religion']=='Agnostic'

In [17]:
df_melt.loc[cond]

     religion            variable  value
0    Agnostic               <$10k     27
18   Agnostic             $10-20k     34
36   Agnostic             $20-30k     60
54   Agnostic             $30-40k     81
72   Agnostic             $40-50k     76
90   Agnostic             $50-75k    137
108  Agnostic            $75-100k    122
126  Agnostic           $100-150k    109
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96

In [18]:
df_melt.rename(columns={'variable':'income', 'value':'count'})

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [22]:
df_melt_new=df.melt(id_vars='religion', var_name='income', value_name='count')
df_melt_new

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [48]:
df_pivot=df_melt_new.pivot(
  index='religion',
  columns='income',
  values='count'
).reset_index()

In [49]:
df_pivot

income,religion,$10-20k,$100-150k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,<$10k,>150k,Don't know/refused
0,Agnostic,34,109,60,81,76,137,122,27,84,96
1,Atheist,27,59,37,52,35,70,73,12,74,76
2,Buddhist,21,39,30,34,33,58,62,27,53,54
3,Catholic,617,792,732,670,638,1116,949,418,633,1489
4,Don’t know/refused,14,17,15,11,10,35,21,15,18,116
5,Evangelical Prot,869,723,1064,982,881,1486,949,575,414,1529
6,Hindu,9,48,7,9,11,34,47,1,54,37
7,Historically Black Prot,244,81,236,238,197,223,131,228,78,339
8,Jehovah's Witness,27,11,24,24,21,30,15,20,6,37
9,Jewish,19,87,25,25,30,95,69,19,151,162
10,Mainline Prot,495,753,619,655,651,1107,939,289,634,1328
11,Mormon,40,49,48,51,56,112,85,29,42,69
12,Muslim,7,8,9,10,9,23,16,6,6,22
13,Orthodox,17,42,23,32,32,47,38,13,46,73
14,Other Christian,7,14,11,13,13,14,18,9,12,18
15,Other Faiths,33,40,40,46,49,63,46,20,41,71
16,Other World Religions,2,4,3,4,2,7,3,5,4,8
17,Unaffiliated,299,321,374,365,341,528,407,217,258,597

In [35]:
billboard_df=pd.read_csv('./data/billboard.csv')
billboard_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 317 entries, 0 to 316
Data columns (total 81 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          317 non-null    int64
 1   artist        317 non-null    object
 2   track         317 non-null    object
 3   time          317 non-null    object
 4   date.entered  317 non-null    object
 5   wk1           317 non-null    int64
 6   wk2           312 non-null    float64
 7   wk3           307 non-null    float64
 8   wk4           300 non-null    float64
 9   wk5           292 non-null    float64
 10  wk6           280 non-null    float64
 11  wk7           269 non-null    float64
 12  wk8           260 non-null    float64
 13  wk9           253 non-null    float64
 14  wk10          244 non-null    float64
 15  wk11          236 non-null    float64
 16  wk12          222 non-null    float64
 17  wk13          210 non-null    float64
 18  wk14          204 non-null    float64
 19  wk15          197 non-null    float64
 20  wk16          182 non-null    float64
 21  wk17          177 non-null    float64
 22  wk18          166 non-null    float64
 23  wk19          156 non-null    float64
 24  wk20          146 non-null    float64
 25  wk21          65 non-null     float64
 26  wk22          55 non-null     float64
 27  wk23          48 non-null     float64
 28  wk24          46 non-null     float64
 29  wk25          38 non-null     float64
 30  wk26          36 non-null     float64
 31  wk27          29 non-null     float64
 32  wk28          24 non-null     float64
 33  wk29          20 non-null     float64
 34  wk30          20 non-null     float64
 35  wk31          19 non-null     float64
 36  wk32          18 non-null     float64
 37  wk33          12 non-null     float64
 38  wk34          10 non-null     float64
 39  wk35          9 non-null      float64
 40  wk36          9 non-null      float64
 41  wk37          9 non-null      float64
 42  wk38          8 non-null      float64
 43  wk39          8 non-null      float64
 44  wk40          7 non-null      float64
 45  wk41          7 non-null      float64
 46  wk42          6 non-null      float64
 47  wk43          6 non-null      float64
 48  wk44          6 non-null      float64
 49  wk45          5 non-null      float64
 50  wk46          5 non-null      float64
 51  wk47          5 non-null      float64
 52  wk48          4 non-null      float64
 53  wk49          4 non-null      float64
 54  wk50          4 non-null      float64
 55  wk51          4 non-null      float64
 56  wk52          4 non-null      float64
 57  wk53          4 non-null      float64
 58  wk54          2 non-null      float64
 59  wk55          2 non-null      float64
 60  wk56          2 non-null      float64
 61  wk57          2 non-null      float64
 62  wk58          2 non-null      float64
 63  wk59          2 non-null      float64
 64  wk60          2 non-null      float64
 65  wk61          2 non-null      float64
 66  wk62          2 non-null      float64
 67  wk63          2 non-null      float64
 68  wk64          2 non-null      float64
 69  wk65          1 non-null      float64
 70  wk66          0 non-null      float64
 71  wk67          0 non-null      float64
 72  wk68          0 non-null      float64
 73  wk69          0 non-null      float64
 74  wk70          0 non-null      float64
 75  wk71          0 non-null      float64
 76  wk72          0 non-null      float64
 77  wk73          0 non-null      float64
 78  wk74          0 non-null      float64
 79  wk75          0 non-null      float64
 80  wk76          0 non-null      float64
dtypes: float64(75), int64(2), object(4)
memory usage: 200.7+ KB

In [36]:
billboard_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 317 entries, 0 to 316
Data columns (total 81 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          317 non-null    int64
 1   artist        317 non-null    object
 2   track         317 non-null    object
 3   time          317 non-null    object
 4   date.entered  317 non-null    object
 5   wk1           317 non-null    int64
 6   wk2           312 non-null    float64
 7   wk3           307 non-null    float64
 8   wk4           300 non-null    float64
 9   wk5           292 non-null    float64
 10  wk6           280 non-null    float64
 11  wk7           269 non-null    float64
 12  wk8           260 non-null    float64
 13  wk9           253 non-null    float64
 14  wk10          244 non-null    float64
 15  wk11          236 non-null    float64
 16  wk12          222 non-null    float64
 17  wk13          210 non-null    float64
 18  wk14          204 non-null    float64
 19  wk15          197 non-null    float64
 20  wk16          182 non-null    float64
 21  wk17          177 non-null    float64
 22  wk18          166 non-null    float64
 23  wk19          156 non-null    float64
 24  wk20          146 non-null    float64
 25  wk21          65 non-null     float64
 26  wk22          55 non-null     float64
 27  wk23          48 non-null     float64
 28  wk24          46 non-null     float64
 29  wk25          38 non-null     float64
 30  wk26          36 non-null     float64
 31  wk27          29 non-null     float64
 32  wk28          24 non-null     float64
 33  wk29          20 non-null     float64
 34  wk30          20 non-null     float64
 35  wk31          19 non-null     float64
 36  wk32          18 non-null     float64
 37  wk33          12 non-null     float64
 38  wk34          10 non-null     float64
 39  wk35          9 non-null      float64
 40  wk36          9 non-null      float64
 41  wk37          9 non-null      float64
 42  wk38          8 non-null      float64
 43  wk39          8 non-null      float64
 44  wk40          7 non-null      float64
 45  wk41          7 non-null      float64
 46  wk42          6 non-null      float64
 47  wk43          6 non-null      float64
 48  wk44          6 non-null      float64
 49  wk45          5 non-null      float64
 50  wk46          5 non-null      float64
 51  wk47          5 non-null      float64
 52  wk48          4 non-null      float64
 53  wk49          4 non-null      float64
 54  wk50          4 non-null      float64
 55  wk51          4 non-null      float64
 56  wk52          4 non-null      float64
 57  wk53          4 non-null      float64
 58  wk54          2 non-null      float64
 59  wk55          2 non-null      float64
 60  wk56          2 non-null      float64
 61  wk57          2 non-null      float64
 62  wk58          2 non-null      float64
 63  wk59          2 non-null      float64
 64  wk60          2 non-null      float64
 65  wk61          2 non-null      float64
 66  wk62          2 non-null      float64
 67  wk63          2 non-null      float64
 68  wk64          2 non-null      float64
 69  wk65          1 non-null      float64
 70  wk66          0 non-null      float64
 71  wk67          0 non-null      float64
 72  wk68          0 non-null      float64
 73  wk69          0 non-null      float64
 74  wk70          0 non-null      float64
 75  wk71          0 non-null      float64
 76  wk72          0 non-null      float64
 77  wk73          0 non-null      float64
 78  wk74          0 non-null      float64
 79  wk75          0 non-null      float64
 80  wk76          0 non-null      float64
dtypes: float64(75), int64(2), object(4)
memory usage: 200.7+ KB

In [38]:
billboard_df.melt(id_vars='artist').sort_values('artist')

                artist variable value
0                2 Pac     year  2000
2853             2 Pac      wk6  94.0
13948            2 Pac     wk41   NaN
20605            2 Pac     wk62   NaN
17435            2 Pac     wk52   NaN
...                ...      ...   ...
17434  matchbox twenty     wk51   NaN
17751  matchbox twenty     wk52   NaN
18068  matchbox twenty     wk53   NaN
15849  matchbox twenty     wk46   NaN
25359  matchbox twenty     wk76   NaN

[25360 rows x 3 columns]

In [39]:
billboard_df_melt=billboard_df.melt(id_vars='artist')

In [40]:
billboard_df

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,86,83.0,77.0,74.0,83.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,85,83.0,83.0,82.0,81.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,95,94.0,91.0,85.0,84.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,99,99.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,matchbox twenty,Bent,4:12,2000-04-29,60,37.0,29.0,24.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
billboard_df.columns

Index(['year', 'artist', 'track', 'time', 'date.entered', 'wk1', 'wk2', 'wk3',
       'wk4', 'wk5', 'wk6', 'wk7', 'wk8', 'wk9', 'wk10', 'wk11', 'wk12',
       'wk13', 'wk14', 'wk15', 'wk16', 'wk17', 'wk18', 'wk19', 'wk20', 'wk21',
       'wk22', 'wk23', 'wk24', 'wk25', 'wk26', 'wk27', 'wk28', 'wk29', 'wk30',
       'wk31', 'wk32', 'wk33', 'wk34', 'wk35', 'wk36', 'wk37', 'wk38', 'wk39',
       'wk40', 'wk41', 'wk42', 'wk43', 'wk44', 'wk45', 'wk46', 'wk47', 'wk48',
       'wk49', 'wk50', 'wk51', 'wk52', 'wk53', 'wk54', 'wk55', 'wk56', 'wk57',
       'wk58', 'wk59', 'wk60', 'wk61', 'wk62', 'wk63', 'wk64', 'wk65', 'wk66',
       'wk67', 'wk68', 'wk69', 'wk70', 'wk71', 'wk72', 'wk73', 'wk74', 'wk75',
       'wk76'],
      dtype='object')

In [44]:
id_vars=billboard_df.columns[:4].tolist()
id_vars

['year', 'artist', 'track', 'time']

In [45]:
b_df_melt=billboard_df.melt(id_vars='id_vars', var_name='week', value_name='rank')
b_df_melt

KeyError: "The following id_vars or value_vars are not present in the DataFrame: ['id_vars']"

#long data 만들기
- 각 변수는 하나의 컬럼에 배치
- 각 관측치는 한행에 1건씩 분리되어 배치
- 각 값은 개별 셀에 배치

-melt()
-pivot()
-pivot_table(): 집계함수를 적용

In [ ]:
#apply

In [59]:
df=pd.DataFrame(
  {
    "a":[10,20,30],
    "b":[20,30,40]
  }
)
df

    a   b
0  10  20
1  20  30
2  30  40

In [60]:
df**2

     a     b
0  100   400
1  400   900
2  900  1600

In [61]:
df/10

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  4.0

In [62]:
def make_sq(x, e=2):
  return x**e

In [63]:
df.apply(make_sq, e=3)

       a      b
0   1000   8000
1   8000  27000
2  27000  64000

In [64]:
import pandas as pd

# 직원 명단 DataFrame 생성
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 45, 35, 32, 28],
    'Salary': [5000, 7000, 6500, 5500, 6000]
}
sal_df=pd.DataFrame(data)
sal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [65]:
def age_category(age):
  if age<30:
    return '20대'
  elif age<40:
    return '30대'
  else:
    return '40대 이상'

In [66]:
sal_df['Age_category']=sal_df['Age'].apply(age_category)

In [67]:
sal_df

      Name  Age  Salary Age_category
0    Alice   25    5000          20대
1      Bob   45    7000       40대 이상
2  Charlie   35    6500          30대
3    David   32    5500          30대
4      Eva   28    6000          20대

In [ ]:
def age_category(age):
  if age<30:
    return '20대'
  elif age<40:
    return '30대'
  else:
    return

In [56]:
sal_df['Age_category']=sal_df['Age'].apply(age_category)

TypeError: age_category() takes 0 positional arguments but 1 was given

In [70]:
def calc_bounus(salary):
  return salary*0.2

In [72]:
sal_df['bonus']=sal_df['Salary'].apply(calc_bonus, rate=0.3)
sal_df

NameError: name 'calc_bonus' is not defined

In [ ]:
#데이터병합

In [73]:
df_1=pd.read_csv('./data/concat_1.csv')
df_2=pd.read_csv('./data/concat_2.csv')
df_3=pd.read_csv('./data/concat_3.csv')

In [74]:
df_1, df_2, df_3

(    A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3,
     A   B   C   D
 0  a4  b4  c4  d4
 1  a5  b5  c5  d5
 2  a6  b6  c6  d6
 3  a7  b7  c7  d7,
      A    B    C    D
 0   a8   b8   c8   d8
 1   a9   b9   c9   d9
 2  a10  b10  c10  d10
 3  a11  b11  c11  d11)

In [ ]:
#column list가 동일하면 병합 가능

In [86]:
total_df=pd.concat([df_1, df_2, df_3], ignore_index=True)

In [87]:
total_df.loc[3]
total_df.reset_index()

    index    A    B    C    D
0       0   a0   b0   c0   d0
1       1   a1   b1   c1   d1
2       2   a2   b2   c2   d2
3       3   a3   b3   c3   d3
4       4   a4   b4   c4   d4
5       5   a5   b5   c5   d5
6       6   a6   b6   c6   d6
7       7   a7   b7   c7   d7
8       8   a8   b8   c8   d8
9       9   a9   b9   c9   d9
10     10  a10  b10  c10  d10
11     11  a11  b11  c11  d11

In [89]:
add_ser=pd.Series(['a100', 'b100', 'c100', 'd100'])
add_ser

0    a100
1    b100
2    c100
3    d100
dtype: object

In [90]:
total_df

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [91]:
total_df_add=pd.concat([total_df, add_ser])
total_df_add

      A    B    C    D     0
0    a0   b0   c0   d0   NaN
1    a1   b1   c1   d1   NaN
2    a2   b2   c2   d2   NaN
3    a3   b3   c3   d3   NaN
4    a4   b4   c4   d4   NaN
5    a5   b5   c5   d5   NaN
6    a6   b6   c6   d6   NaN
7    a7   b7   c7   d7   NaN
8    a8   b8   c8   d8   NaN
9    a9   b9   c9   d9   NaN
10  a10  b10  c10  d10   NaN
11  a11  b11  c11  d11   NaN
0   NaN  NaN  NaN  NaN  a100
1   NaN  NaN  NaN  NaN  b100
2   NaN  NaN  NaN  NaN  c100
3   NaN  NaN  NaN  NaN  d100

In [ ]:
시리즈를 행으로 만들어서 ConnectionAbortedError

- 원본과 동일한 컬럼을 갖는 데이터프레임 생성
- 컬럼이름 = 인덱스이름 시리즈 생성 (동일해야)

In [94]:
import pandas as pd

df = pd.DataFrame({
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호'],
    '나이': [25, 28, 31, 24, 35],
    '점수': [80, 90, 85, 70, 95]
})

df

    이름  나이  점수
0  김철수  25  80
1  이영희  28  90
2  박민수  31  85
3  정수진  24  70
4  최영호  35  95

In [95]:
df[1:4]

    이름  나이  점수
1  이영희  28  90
2  박민수  31  85
3  정수진  24  70

In [96]:
  df.loc[1:3, ['이름', '점수']]

    이름  점수
1  이영희  90
2  박민수  85
3  정수진  70

In [ ]:
매출 데이터
sales_data = pd.DataFrame({ 'CustomerID': [101, 102, 103, 104], 'Date': ['2023-01-01', '2023-01-03', '2023-01-05', '2023-01-07'], 'Amount': [250, 300, 150, 400] })

고객 데이터
customer_data = pd.DataFrame({ 'CustomerID': [101, 102, 103, 105], 'Name': ['Alice', 'Bob', 'Charlie', 'Eva'], 'Region': ['North', 'South', 'East', 'West'] })

In [ ]:
#merge: 키를 기준으로 합친다. sql의 조인 기능

In [1]:
import pandas as pd

In [2]:
sales_data = pd.DataFrame({ 
    'CustomerID': [101, 102, 103, 104], 
    'Date': ['2023-01-01', '2023-01-03', '2023-01-05', '2023-01-07'], 
    'Amount': [250, 300, 150, 400] 
  })

In [3]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4 non-null      int64
 1   Date        4 non-null      object
 2   Amount      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [4]:
customer_data = pd.DataFrame({'CustomerID': [101, 102, 103, 105], 'Name': ['Alice', 'Bob', 'Charlie', 'Eva'], 'Region': ['North', 'South', 'East', 'West'] })

In [5]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4 non-null      int64
 1   Name        4 non-null      object
 2   Region      4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [6]:
pd.merge(customer_data, sales_data, on='CustomerID')

   CustomerID     Name Region        Date  Amount
0         101    Alice  North  2023-01-01     250
1         102      Bob  South  2023-01-03     300
2         103  Charlie   East  2023-01-05     150

In [7]:
pd.merge(customer_data, sales_data, on='CustomerID', how='left')

   CustomerID     Name Region        Date  Amount
0         101    Alice  North  2023-01-01   250.0
1         102      Bob  South  2023-01-03   300.0
2         103  Charlie   East  2023-01-05   150.0
3         105      Eva   West         NaN     NaN

In [ ]:
how - 병합 기준 지정
-left
-right
-inner (default)
-outer

on-병합을 위한 key 지정

In [ ]:
#그룹연산
groupby()+aggregation 집계

In [10]:
gap_df=pd.read_csv('./data/gapminder.tsv', sep='\t')
gap_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [14]:
gap_df.loc[:,'country']
gap_df['country'].unique().shape

(142,)

In [16]:
gap_df.loc[:,'continent']
gap_df['continent'].unique().shape

(5,)

In [17]:
gap_df.loc[:,'year']
gap_df['year'].unique().shape

(12,)

In [21]:
gap_df.groupby('country')[['lifeExp', 'pop']].sum()

                    lifeExp        pop
country
Afghanistan         449.746  189884585
Albania             821.195   30962990
Algeria             708.362  238504874
Angola              454.602   87712681
Argentina           828.725  343226879
...                     ...        ...
Vietnam             689.754  654822851
West Bank and Gaza  723.944   22183278
Yemen, Rep.         561.365  130118302
Zambia              551.956   76245658
Zimbabwe            631.958   91703593

[142 rows x 2 columns]

In [ ]:
gap_df.groupby('country').get_group('Afghanistan')

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [24]:
gap_df.groupby('continent')['country'].count()

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: country, dtype: int64

In [ ]:
count(), size(), mean(), std(), quantile(), max(), min(), sum(), var(), describe()

In [28]:
gap_df.groupby('lifeExp').size()

lifeExp
23.599    1
28.801    1
30.000    1
30.015    1
30.331    1
         ..
81.701    1
81.757    1
82.000    1
82.208    1
82.603    1
Length: 1626, dtype: int64

In [29]:
gap_df.groupby('continent')['country'].agg(['count', 'size'])

           count  size
continent
Africa       624   624
Americas     300   300
Asia         396   396
Europe       360   360
Oceania       24    24

In [30]:
gap_df.groupby('continent')['country'].size()

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: country, dtype: int64

In [ ]:
# 자동차 생산량 데이터 모양 만들기

In [34]:
veh_df=pd.read_csv('./data/vehicle_prod.csv')
veh_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  6 non-null      object
 1   2007        6 non-null      float64
 2   2008        6 non-null      float64
 3   2009        6 non-null      float64
 4   2010        6 non-null      float64
 5   2011        6 non-null      float64
dtypes: float64(5), object(1)
memory usage: 416.0+ bytes

In [35]:
veh_df.rename(columns={'Unnamed:0':'country'}, inplace=True)
veh_df

  Unnamed: 0   2007   2008   2009   2010   2011
0      China   7.71   7.95  11.96  15.84  16.33
1         EU  19.02  17.71  15.00  16.70  17.48
2         US  10.47   8.45   5.58   7.60   8.40
3      Japan  10.87  10.83   7.55   9.09   7.88
4      Korea   4.04   3.78   3.45   4.20   4.62
5     Mexico   2.01   2.05   1.50   2.25   2.54

In [36]:
veh_df.set_index('country', inplace=True)
veh_df

KeyError: "None of ['country'] are in the columns"

In [ ]:
veh_df=pd.read_csv('./data/vehicle_prod.csv')

In [38]:
veh_df.describe()

            2007       2008       2009       2010       2011
count   6.000000   6.000000   6.000000   6.000000   6.000000
mean    9.020000   8.461667   7.506667   9.280000   9.541667
std     6.019661   5.557519   5.142621   5.935921   6.105887
min     2.010000   2.050000   1.500000   2.250000   2.540000
25%     4.957500   4.822500   3.982500   5.050000   5.435000
50%     9.090000   8.200000   6.565000   8.345000   8.140000
75%    10.770000  10.235000  10.857500  14.152500  14.347500
max    19.020000  17.710000  15.000000  16.700000  17.480000

In [39]:
#총생산량 컬럼 추가
veh_df['total_production']=veh_df.sum(axis=1)

TypeError: can only concatenate str (not "float") to str